In [8]:
import pandas as pd
import numpy as np1

In [9]:
laptop = pd.read_excel("Laptop.xlsx")
laptop.head()

   Laptop      Model  Year  RAM  Storage  Price
0      HP  Elitebook  2018    4        0  61800
1  Lenovo    Ideapad  2014    8        0  53600
2    Acer   Notebook  2015   12        0  75200
3    Dell   Latitude  2020   16        0  67100
4     MSI  Primebook  2012   12        0  53300

In [3]:
laptop.shape

(18, 6)

In [4]:
Storage = np.random.choice([128,256,512],18)
Storage

NameError: name 'np' is not defined

In [ ]:
laptop.info()

In [ ]:
laptop.describe()

In [ ]:
laptop.duplicated()

In [ ]:
laptop.isna().sum()

In [ ]:
laptop["Storage"]= Storage 
laptop.head()

In [ ]:
laptop["RAM"] = laptop["RAM"].replace(12,np.nan)

In [ ]:
laptop["RAM"].isna()

In [ ]:
laptop["RAM"].isna().sum()

In [ ]:
laptop["RAM"].fillna(8)

In [ ]:
laptop["RAM"]=laptop["RAM"].fillna(laptop["RAM"].quantile(0.5))

In [ ]:
laptop["RAM"].quantile([0.1,0.25,0.35,0.5,0.6,0.75,0.8,0.95,0.99])

In [ ]:
laptop.groupby("Laptop").mean("Price")

In [ ]:
laptop.groupby("Laptop").sum("Price")

In [ ]:
laptop.groupby("Laptop").count()

In [ ]:
laptop["Laptop"].value_counts()

In [ ]:
laptop["RAM"].value_counts()

In [ ]:
laptop["Model"].unique()

In [ ]:
laptop["Model"].unique().tolist() #will convert array into list

In [ ]:
sales = pd.read_excel("Sales.xlsx")

In [ ]:
sales.head()

In [ ]:
sales.groupby("Name").sum("Sales")

In [ ]:
sales.groupby("Month").sum("Sales")

In [ ]:
pd.pivot(sales,index = "Name",columns ="Month",values = "Sales")

In [ ]:
pd.pivot_table(sales, index = "Name",columns ="Month",values = "Sales")

In [ ]:
new_sales = pd.concat([sales, sales],axis = 0)

In [ ]:
new_sales

In [ ]:
pd.pivot_table(new_sales, index = "Name",columns ="Month",values = "Sales", aggfunc="sum")

In [ ]:
pd.pivot_table(new_sales, index = "Name",columns ="Month",values = "Sales",aggfunc="mean")

In [ ]:
pvt_tbl_sales = pd.pivot_table(new_sales, index = "Name",columns ="Month",values = "Sales", aggfunc="sum")

In [ ]:
pvt_tbl_sales

In [ ]:
pvt_tbl_sales.reset_index()

In [ ]:
sales

In [ ]:
sales.groupby("Name").sum().plot.bar()

In [ ]:
sales.groupby("Name").mean("Sales").plot.pie(subplots = True)

In [14]:
#mark1 = pd.read_excel("mark1.xlsx")
mark2 = pd.read_excel("mark2.xlsx")

In [24]:
mark1 = pd.read_excel("mark1.xlsx")
mark2 = pd.read_excel("mark2.xlsx")

In [18]:
mark1

   Name  Math  Science
0   Ram    67       45
1  Sham    59       42
2  Sita    87       86
3  Gita    65       46

In [19]:
mark2

   Name  English  Sports
0   Ram       87      46
1  Sham       56      75
2  Sita       64      67
3  Gita       98      75

In [41]:
mark1 = pd.read_excel("mark1.xlsx")
mark2 = pd.read_excel("mark2.xlsx")

In [42]:
mark1

     Name  Math  Science
0     Ram    67       45
1    Sham    59       42
2    Sita    87       86
3    Gita    65       46
4  Rinku     73       47
5    Raju    90       67

In [32]:
mark2

     Name  English  Sports
0     Ram       87      46
1    Sham       56      75
2    Sita       64      67
3    Gita       98      75
4  Rockey       55      70

In [33]:
mark1.merge(mark2,on = "Name" , how = "inner")

   Name  Math  Science  English  Sports
0   Ram    67       45       87      46
1  Sham    59       42       56      75
2  Sita    87       86       64      67
3  Gita    65       46       98      75

In [34]:
mark1.merge(mark2,on = "Name" , how = "outer")

     Name  Math  Science  English  Sports
0     Ram  67.0     45.0     87.0    46.0
1    Sham  59.0     42.0     56.0    75.0
2    Sita  87.0     86.0     64.0    67.0
3    Gita  65.0     46.0     98.0    75.0
4  Rinku   73.0     47.0      NaN     NaN
5  Rockey   NaN      NaN     55.0    70.0

In [45]:
mark1.merge(mark2,on = "Name" , how = "left")

     Name  Math  Science  English  Sports
0     Ram    67       45     87.0    46.0
1    Sham    59       42     56.0    75.0
2    Sita    87       86     64.0    67.0
3    Gita    65       46     98.0    75.0
4  Rinku     73       47      NaN     NaN
5    Raju    90       67      NaN     NaN

In [46]:
mark1.merge(mark2,on = "Name" , how = "right")

     Name  Math  Science  English  Sports
0     Ram  67.0     45.0       87      46
1    Sham  59.0     42.0       56      75
2    Sita  87.0     86.0       64      67
3    Gita  65.0     46.0       98      75
4  Rockey   NaN      NaN       55      70

In [37]:
mark2.merge(mark1,on = "Name" , how = "left")

     Name  English  Sports  Math  Science
0     Ram       87      46  67.0     45.0
1    Sham       56      75  59.0     42.0
2    Sita       64      67  87.0     86.0
3    Gita       98      75  65.0     46.0
4  Rockey       55      70   NaN      NaN

In [47]:
mark2.merge(mark1,on = "Name" , how = "right")

     Name  English  Sports  Math  Science
0     Ram     87.0    46.0    67       45
1    Sham     56.0    75.0    59       42
2    Sita     64.0    67.0    87       86
3    Gita     98.0    75.0    65       46
4  Rinku       NaN     NaN    73       47
5    Raju      NaN     NaN    90       67

In [44]:
mark1.join(mark2,lsuffix = "_left",rsuffix = "_right",how ="outer")

  Name_left  Math  Science Name_right  English  Sports
0       Ram    67       45        Ram     87.0    46.0
1      Sham    59       42       Sham     56.0    75.0
2      Sita    87       86       Sita     64.0    67.0
3      Gita    65       46       Gita     98.0    75.0
4    Rinku     73       47     Rockey     55.0    70.0
5      Raju    90       67        NaN      NaN     NaN

In [43]:
mark1.join(mark2,lsuffix = "_left",rsuffix = "_right",how ="inner")

  Name_left  Math  Science Name_right  English  Sports
0       Ram    67       45        Ram       87      46
1      Sham    59       42       Sham       56      75
2      Sita    87       86       Sita       64      67
3      Gita    65       46       Gita       98      75
4    Rinku     73       47     Rockey       55      70